In [178]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [179]:

df = pd.DataFrame({'name': ['John Paul Smith', 'Brian David Jones', 'Harry William Roberts'],
                   'website': ['https://www.johnsmith.com', 'https://www.brianjones.com', 'https://www.harryroberts.com'],   
                   'telephone': ['(01234) 5678910', '(05432) 9876543', '(09876) 5432109'], 
                    'username': ['john_smith', 'brian_jones', 'harry_roberts']})

In [180]:
df

,name,website,telephone,username
0,John Paul Smith,https://www.johnsmith.com,(01234) 5678910,john_smith
1,Brian David Jones,https://www.brianjones.com,(05432) 9876543,brian_jones
2,Harry William Roberts,https://www.harryroberts.com,(09876) 5432109,harry_roberts

In [181]:
df['split_name'] = df['name'].str.split()
data=df[['name', 'split_name']]

In [182]:
data

                    name                 split_name
0        John Paul Smith        [John, Paul, Smith]
1      Brian David Jones      [Brian, David, Jones]
2  Harry William Roberts  [Harry, William, Roberts]

In [183]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        3 non-null      object
 1   split_name  3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes

In [ ]:
data

In [184]:
data=data.explode('split_name').reset_index(drop=True)

In [185]:
data

                    name split_name
0        John Paul Smith       John
1        John Paul Smith       Paul
2        John Paul Smith      Smith
3      Brian David Jones      Brian
4      Brian David Jones      David
5      Brian David Jones      Jones
6  Harry William Roberts      Harry
7  Harry William Roberts    William
8  Harry William Roberts    Roberts